src/InformationRegisters/bz_ПочасовыеСтавкиРабот/bz_ПочасовыеСтавкиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>bz_ПочасовыеСтавкиРабот</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.bz_Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef.bz_Работы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/bz_ПочасовыеСтавкиРабот/ManagerModule.bsl
Функция ПолучитьСтавку(знач Дата, знач Проект, знач Работа, знач КонтрагентРаботодатель) Экспорт 
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Проект КАК Проект,
	|	Т.Работа КАК Работа,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Ставка КАК Ставка,
	|	Т.Действует КАК Действует,
	|	Т.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.bz_ПочасовыеСтавкиРабот.СрезПоследних(
	|			&Дата,
	|			Контрагент В (&Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|				И Проект В (&Проект, ЗНАЧЕНИЕ(Справочник.bz_Проекты.ПустаяСсылка))
	|				И Работа В (&Работа, ЗНАЧЕНИЕ(Справочник.bz_Работы.ПустаяСсылка))) КАК Т
	|ГДЕ
	|	Т.Действует = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	Запрос.УстановитьПараметр("Контрагент", КонтрагентРаботодатель);
	Запрос.УстановитьПараметр("Работа", Работа);
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Дата", Дата);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ставка;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции
